# не успел изучить, как работают функции def, return, поэтому пока без них(

# ===================================== Первый вариант реализации =======================================
a = ("процент")
b = ("процентов")
c = ("процента")
dict_numbers = {11,12,13,14}  # инициализация словаря для четырёх чисел-исключений.
for i in range(100):
    i += 1
    if i in dict_numbers:  # условие для чисел 11, 12, 13 и 14.
       print(f'{i} {b}')
    elif i % 10 == 1:  # условие для чисел заканчивающихся на 1.
        print(f'{i} {a}')
    elif (i % 10) > 1 and (i % 10) <5:  # условие для чисел заканчивающихся на 2, 3 и 4.
        print(f'{i} {c}')
    else:
        print(f'{i} {b}')  # условие для оставшихся чисел.

# ===================================== Второй вариант реализации =======================================
while True:
    number = int(input('Введите любое число для склонения: '))
    if number // 10 == 1 or number % 10 > 4 or number % 10 == 0:
        ending = "ов"
    elif number % 10 == 1:
        ending = ""
    else:
        ending = "а"
    print(number, "процент" + ending)
    number += 1