# Задание 5
# Напишите программу, которая считывала бы имя человека, а затем его возраст и выдавала строку.

name = input("Как вас зовут? \n")
age = int(input("Сколько вам лет? \n"))
print(f'{name} is {age} years old.')