# Задание 4
# Напишите программу, которая бы находила решение следующего линейного уравнения: ax + b = 0
# (Гарантируется что а не равно 0, сначала на вход подается a затем b)

a = int(input('Введите a: '))
b = int(input('Введите b: '))
x = (b/a)
print(-x)
